document.write("<div style='display:none'><div id='noneid'></div></div>");
var $ = function(id) {
	$a = document.getElementById(id);
	if ($a) {
		return $a;
	} else {
		return document.getElementById("noneid");
	}
};
var $b = $("ubzptype").options[$("ubzptype").selectedIndex].value;
if ($b > 99) {
	$a = $("ubzptype");
	v = $a.options[$a.selectedIndex].value;
	t = $a.options[$a.selectedIndex].text;
	$a.length = 0;
	$a.options[$a.length] = new Option(t, v);
} else if ($("ubzptype").length == 5) {
	$("ubzptype").length = $("ubzptype").length - 1;
} else if ($("ubzptype").length > 4) {
	$("ubzptype").length = $("ubzptype").length - 2;
};
var $c = new Array(new Array("2001", "移动,联通,小灵通话费在线充值", "", "", ""), new Array(
		"2002", "移动话费充值模板(10元倍数50元以下)", "", "", ""), new Array("2003",
		"移动话费充值模板(10元倍数50元以上)", "", "", ""), new Array("2004",
		"联通话费充值模板(10元倍数)", "", "", ""), new Array("2005", "电信话费充值模板(10元倍数)",
		"", "", ""), new Array("5001", "只填充值帐号通用充值模板(多张)", "", "", ""),
		new Array("5002", "只填充值帐号通用充值模板(单张)", "", "", ""), new Array("5003",
				"只填充值帐号通用充值模板(10元倍数)", "", "", ""), new Array("5005",
				"只填充值帐号通用充值模板(5元倍数范围5-1000)", "", "", ""), new Array("5004",
				"只填充值帐号通用充值模板(1-5张)", "", "", ""), new Array("6001",
				"只填充值帐号通用型按元充值模板(多张)", "", "", ""), new Array("7001",
				"填写充值用户名及其密码充值模板(单张)", "", "", ""), new Array("7002",
				"填写充值用户名及其密码充值模板(多张)", "", "", ""), new Array("101",
				"G-光宇-光宇推广员光宇币转赠按元充值", "", "", ""), new Array("102",
				"G-光宇-光宇推广员光宇币转赠50元充值", "", "", ""), new Array("103",
				"G-光宇-光宇推广员光宇币转赠100元充值", "", "", ""), new Array("104",
				"G-光宇-光宇直通车按元直充", "", "", ""), new Array("105",
				"G-光宇-光宇直通车按元直充(5元倍数)", "", "", ""), new Array("8001",
				"H-黄金岛按元在线充值模板", "", "", ""), new Array("201",
				"K-酷银在线销售按元在线充值", "", "", ""), new Array("301", "L-联众-联众币按元充值",
				"", "", ""), new Array("404", "L-蓝港在线所有产品按元充值", "", "", ""),
		new Array("401", "L-蓝港在线-倚天剑与屠龙刀按元充值", "", "", ""), new Array("402",
				"L-蓝港在线-神兽按元在线充值", "", "", ""), new Array("403",
				"L-蓝港在线-问鼎按元在线充值", "", "", ""), new Array("405",
				"L-蓝港在线-大话轩辕按元在线充值", "", "", ""), new Array("406",
				"L-蓝港在线-西游记OL按元在线充值", "", "", ""), new Array("407",
				"L-蓝港在线-梦幻魔兽按元在线充值", "", "", ""), new Array("408",
				"L-蓝港在线-倚天剑与屠龙刀2按元充值", "", "", ""), new Array("409",
				"L-蓝港在线-东邪西毒按元充值", "", "", ""), new Array("410",
				"L-蓝港在线-快乐神仙按元充值", "", "", ""), new Array("411",
				"L-蓝港在线-热血西游按元充值", "", "", ""), new Array("412",
				"L-蓝港在线-魔神无双按元充值", "", "", ""), new Array("413",
				"L-蓝港在线-铁血丹心按元充值", "", "", ""), new Array("9000",
				"M-摩力游在线自动充值模板", "", "", ""), new Array("523", "J-九城-王者世界按元充值",
				"", "", ""), new Array("524", "J-九城-商业大亨按元充值", "", "", ""),
		new Array("525", "J-九城-名将三国按元充值", "", "", ""), new Array("526",
				"J-九城-九洲战记按元充值", "", "", ""), new Array("527", "J-九城-FIFA按元充值",
				"", "", ""), new Array("530", "J-九城-新奇迹世界按元充值", "", "", ""),
		new Array("531", "J-九城-三国群英传2按元充值", "", "", ""), new Array("532",
				"J-九城-热血三国按元充值", "", "", ""), new Array("534", "J-九城-热血球球按元充值",
				"", "", ""), new Array("533", "J-九城-所有游戏按元充值", "", "", ""),
		new Array("601", "J-金山-5元直储(所有游戏)", "", "", ""), new Array("602",
				"J-金山-15元直储(所有游戏)", "", "", ""), new Array("603",
				"J-金山-48元直储(所有游戏)", "", "", ""), new Array("604",
				"J-金山-50元直储(所有游戏)", "", "", ""), new Array("605",
				"J-金山-100元直储(所有游戏)", "", "", ""), new Array("610",
				"J-金山一卡通直储通用模板(所有游戏)(单张)", "", "", ""), new Array("611",
				"J-金山一卡通按元直储", "", "", ""), new Array("703",
				"J-久游-久游10元倍数专用模版", "", "", ""), new Array("701",
				"J-久游-久游帐号按元充值2-180元", "", "", ""), new Array("702",
				"J-久游-紫界帐号按元充值10-100元", "", "", ""), new Array("10101",
				"Q-麒麟一卡通直储", "", "", ""), new Array("821",
				"T-腾讯SUP专用-Q币直储通用模板(10倍数)", "", "", ""), new Array("801",
				"T-腾讯-Q币直储(新版财付通直通车)", "", "", ""), new Array("802",
				"T-腾讯-Q点直储(新版财付通直通车)", "", "", ""), new Array("803",
				"T-腾讯-QQ包月类服务(新版财付通直通车)", "", "", ""), new Array("844",
				"T-腾讯-QQ包月(蓝钻/粉钻/紫钻/音速)类服务(新版财付通直通车)", "", "", ""), new Array(
				"845", "T-腾讯-QQ包月(会员/黄钻/红钻/绿钻)类服务(新版财付通直通车)", "", "", ""),
		new Array("837", "T-腾讯-QQ512M硬盘包月(新版财付通直通车)", "", "", ""), new Array(
				"838", "T-腾讯-QQ游戏欢乐大礼包(新版财付通直通车)", "", "", ""), new Array(
				"839", "T-腾讯-QQ飞车点券(新版财付通直通车)", "", "", ""), new Array("840",
				"T-腾讯-DNF点券(新版财付通直通车)", "", "", ""), new Array("841",
				"T-腾讯-CF点券(新版财付通直通车)", "", "", ""), new Array("842",
				"T-腾讯-CF会员(新版财付通直通车)", "", "", ""), new Array("849",
				"T-腾讯-战地之王AVA点券(新版财付通直通车)", "", "", ""), new Array("850",
				"T-腾讯-战地之王AVA会员(新版财付通直通车)", "", "", ""), new Array("843",
				"T-腾讯-七雄争霸元宝直储(新版财付通直通车)", "", "", ""), new Array("846",
				"T-腾讯-QQ炫舞紫钻直储(新版财付通直通车)", "", "", ""), new Array("847",
				"T-腾讯-QQ炫舞点券按元直储(新版财付通直通车)", "", "", ""), new Array("848",
				"T-腾讯-大明龙权点券按元直储(新版财付通直通车)", "", "", ""), new Array("825",
				"T-腾讯-洛克王国会员直储(新版财付通直通车)", "", "", ""), new Array("804",
				"T-腾讯-地下城与勇士DNF黑钻包月服务(新版财付通直通车)", "", "", ""), new Array("826",
				"T-腾讯-英雄联盟点券按元直储(新版财付通直通车)", "", "", ""), new Array("827",
				"T-腾讯-QQ仙侠传元宝按元直储(新版财付通直通车)", "", "", ""), new Array("828",
				"T-腾讯-QQ西游元宝按元直储(新版财付通直通车)", "", "", ""), new Array("829",
				"T-腾讯-QQ西游VIP直储(新版财付通直通车)", "", "", ""), new Array("869",
				"T-腾讯-QQ水浒银票直储(新版财付通直通车)", "", "", ""), new Array("870",
				"T-腾讯-QQ特工点券直储(新版财付通直通车)", "", "", ""), new Array("871",
				"T-腾讯-第九大陆点券直储(新版财付通直通车)", "", "", ""), new Array("872",
				"T-腾讯-绿色征途点券直储(新版财付通直通车)", "", "", ""), new Array("873",
				"T-腾讯-QQ华夏点券直储(新版财付通直通车)", "", "", ""), new Array("874",
				"T-腾讯-QQ仙境仙点直储(新版财付通直通车)", "", "", ""), new Array("875",
				"T-腾讯-宝石总动员宝石直储(新版财付通直通车)", "", "", ""), new Array("876",
				"T-腾讯-摩登城市云币直储(新版财付通直通车)", "", "", ""), new Array("877",
				"T-腾讯-天堂岛海贝直储(新版财付通直通车)", "", "", ""), new Array("878",
				"T-腾讯-Q宠大乐斗斗豆直储(新版财付通直通车)", "", "", ""), new Array("879",
				"T-腾讯-QQ三国点直储(新版财付通直通车)", "", "", ""), new Array("880",
				"T-腾讯-寻仙仙玉直储(新版财付通直通车)", "", "", ""), new Array("881",
				"T-腾讯-寻仙VIP直储(新版财付通直通车)", "", "", ""), new Array("882",
				"T-腾讯-御龙在天金子直储(新版财付通直通车)", "", "", ""), new Array("883",
				"T-腾讯-星魂币直储(新版财付通直通车)", "", "", ""), new Array("884",
				"T-腾讯-江湖笑金币直储(新版财付通直通车)", "", "", ""), new Array("885",
				"T-腾讯-QQ九仙元宝直储(新版财付通直通车)", "", "", ""), new Array("886",
				"T-腾讯-王朝霸域点券直储(新版财付通直通车)", "", "", ""), new Array("887",
				"T-腾讯-超级明星金币直储(新版财付通直通车)", "", "", ""), new Array("888",
				"T-腾讯-烽火战国点券直储(新版财付通直通车)", "", "", ""), new Array("889",
				"T-腾讯-丝路英雄币直储(新版财付通直通车)", "", "", ""), new Array("890",
				"T-腾讯-魔幻大陆元宝直储(新版财付通直通车)", "", "", ""), new Array("891",
				"T-腾讯-超级QQ直储(新版财付通直通车)", "", "", ""), new Array("892",
				"T-腾讯-九界点券直储(新版财付通直通车)", "", "", ""), new Array("893",
				"T-腾讯-楚河汉界直储(新版财付通直通车)", "", "", ""), new Array("805",
				"T-腾讯-Q币直储(腾讯直通车)", "", "", ""), new Array("816",
				"T-腾讯-Q币直储(腾讯直通车)5元起模板", "", "", ""), new Array("806",
				"T-腾讯-Q点直储(腾讯直通车)", "", "", ""), new Array("807",
				"T-腾讯-QQ华夏直储(腾讯直通车)", "", "", ""), new Array("808",
				"T-腾讯-QQ服务直储(腾讯直通车)", "", "", ""), new Array("809",
				"T-腾讯-QQ三国点数直储(腾讯直通车)", "", "", ""), new Array("810",
				"T-腾讯-地下城与勇士DNF点卷直储(腾讯直通车)", "", "", ""), new Array("811",
				"T-腾讯-地下城与勇士DNF黑钻直储(腾讯直通车)", "", "", ""), new Array("812",
				"T-腾讯-QQ黄钻直储(腾讯直通车)", "", "", ""), new Array("813",
				"T-腾讯-QQ炫舞紫钻包月服务(腾讯直通车)", "", "", ""), new Array("814",
				"T-腾讯-英雄岛点卷(腾讯直通车)", "", "", ""), new Array("815",
				"T-腾讯-绿色征途点卷(腾讯直通车)", "", "", ""), new Array("817",
				"T-腾讯-七雄争霸元宝充值(腾讯直通车)", "", "", ""), new Array("818",
				"T-腾讯-超级明星金币充值(腾讯直通车)", "", "", ""), new Array("819",
				"T-腾讯-穿越火线CF点卷直储(腾讯直通车)", "", "", ""), new Array("820",
				"T-腾讯-易贝点卷直储(腾讯直通车)", "", "", ""), new Array("831",
				"T-腾讯SUP专用-只填QQ号通用充值模板(多张)", "", "", ""), new Array("832",
				"T-腾讯SUP专用-只填QQ号通用充值模板(单张)", "", "", ""), new Array("833",
				"T-腾讯SUP专用-只填QQ号通用充值模板(10元倍数)", "", "", ""), new Array("834",
				"T-腾讯SUP专用-只填QQ号通用充值模板(1-5张)", "", "", ""), new Array("835",
				"T-腾讯SUP专用-只填QQ号通用型按元充值模板(多张)", "", "", ""), new Array("836",
				"T-腾讯SUP专用-填写QQ号及其密码充值模板(单张)", "", "", ""), new Array("851",
				"T-腾讯-子类-QQ会员-QQ包月类服务(新版财付通直通车)", "", "", ""), new Array("852",
				"T-腾讯-子类-QQ家园黄钻-QQ包月类服务(新版财付通直通车)", "", "", ""), new Array(
				"853", "T-腾讯-子类-QQ游戏超级玩家蓝钻-QQ包月类服务(新版财付通直通车)", "", "", ""),
		new Array("854", "T-腾讯-子类-QQ秀红钻-QQ包月类服务(新版财付通直通车)", "", "", ""),
		new Array("855", "T-腾讯-子类-QQ宠物粉钻贵族-QQ包月类服务(新版财付通直通车)", "", "", ""),
		new Array("856", "T-腾讯-子类-QQ音乐VIP绿钻-QQ包月类服务(新版财付通直通车)", "", "", ""),
		new Array("857", "T-腾讯-子类-QQ堂紫钻-QQ包月类服务(新版财付通直通车)", "", "", ""),
		new Array("858", "T-腾讯-子类-QQ音速-QQ包月类服务(新版财付通直通车)", "", "", ""),
		new Array("859", "T-腾讯-子类-QQ飞车紫钻-QQ包月类服务(新版财付通直通车)", "", "", ""),
		new Array("861", "T-腾讯-子类-QQ会员-QQ服务直储(腾讯直通车)", "", "", ""), new Array(
				"862", "T-腾讯-子类-QQ家园黄钻-QQ服务直储(腾讯直通车)", "", "", ""), new Array(
				"863", "T-腾讯-子类-QQ游戏超级玩家蓝钻-QQ服务直储(腾讯直通车)", "", "", ""),
		new Array("864", "T-腾讯-子类-QQ秀红钻-QQ服务直储(腾讯直通车)", "", "", ""), new Array(
				"865", "T-腾讯-子类-GMAIL-QQ服务直储(腾讯直通车)", "", "", ""), new Array(
				"866", "T-腾讯-子类-Qqring(QQ炫铃)-QQ服务直储(腾讯直通车)", "", "", ""),
		new Array("867", "T-腾讯-子类-QQ音乐VIP绿钻-QQ服务直储(腾讯直通车)", "", "", ""),
		new Array("868", "T-腾讯-子类-QQ交友高级用户-QQ服务直储(腾讯直通车)", "", "", ""),
		new Array("951", "W-网龙全游戏充值模板", "", "", ""), new Array("952",
				"W-网龙游戏帐号VIP星级绑定直储", "", "", ""), new Array("953",
				"W-网龙-魔域神之祝福包月直储", "", "", ""), new Array("901",
				"W-网龙-魔域50元魔石卡充值", "", "", ""), new Array("902",
				"W-网龙-魔域10元魔石卡充值", "", "", ""), new Array("903",
				"W-网龙-征服50元天石卡充值", "", "", ""), new Array("904",
				"W-网龙-征服10元天石卡充值", "", "", ""), new Array("905",
				"W-网龙-机战10元太阳石卡充值", "", "", ""), new Array("906",
				"W-网龙-机战50元太阳石卡充值", "", "", ""), new Array("907",
				"W-网龙-魔域密保卡在线充值", "", "", ""), new Array("908",
				"W-网龙-机战帐号锁在线充值", "", "", ""), new Array("909",
				"W-网龙-投名状10元元宝充值", "", "", ""), new Array("910",
				"W-网龙-投名状50元元宝充值", "", "", ""), new Array("911",
				"W-网龙-投名状帐号锁在线充值", "", "", ""), new Array("912",
				"W-网龙-英雄无敌10元魔石卡充值", "", "", ""), new Array("913",
				"W-网龙-英雄无敌50元魔石卡充值", "", "", ""), new Array("914",
				"W-网龙-开心50元灵石卡充值", "", "", ""), new Array("915",
				"W-网龙-开心10元灵石卡充值", "", "", ""), new Array("916",
				"W-网龙-YY仙战10元仙石卡充值", "", "", ""), new Array("917",
				"W-网龙-YY仙战50元仙石卡充值", "", "", ""), new Array("918",
				"W-网龙-王者重生10元金币卡充值", "", "", ""), new Array("919",
				"W-网龙-王者重生50元金币卡充值", "", "", ""), new Array("920",
				"W-网龙-策马三国10元玉币卡充值", "", "", ""), new Array("921",
				"W-网龙-策马三国50元玉币卡充值", "", "", ""), new Array("922",
				"W-网龙-天元10元仙晶卡充值", "", "", ""), new Array("923",
				"W-网龙-天元50元仙晶卡充值", "", "", ""), new Array("924",
				"W-网龙-天元密保卡在线充值", "", "", ""), new Array("925",
				"W-网龙-魔域掉钱版10元神石卡充值", "", "", ""), new Array("926",
				"W-网龙-魔域掉钱版50元神石卡充值", "", "", ""), new Array("1001",
				"W-完美时空10元在线充值(所有产品)", "", "", ""), new Array("1002",
				"W-完美时空20元在线充值(所有产品)", "", "", ""), new Array("1003",
				"W-完美时空50元在线充值(所有产品)", "", "", ""), new Array("1004",
				"W-完美时空100元在线充值(所有产品)", "", "", ""), new Array("1011",
				"W-完美直通车接口10元在线充值", "", "", ""), new Array("1012",
				"W-完美直通车接口20元在线充值", "", "", ""), new Array("1013",
				"W-完美直通车接口50元在线充值", "", "", ""), new Array("1014",
				"W-完美直通车接口100元在线充值", "", "", ""), new Array("1021",
				"W-完美一卡通在线充值(所有产品)(1张)", "", "", ""), new Array("1022",
				"W-完美时空按元充值(普通接口/直通车接口通用)", "", "", ""), new Array("1023",
				"W-完美点券在线充值", "", "", ""), new Array("1132", "W-网易-按元充值(不可寄售)",
				"", "", ""), new Array("1130", "W-网易-按元充值(普通接口)", "", "", ""),
		new Array("1109", "W-网易-战网一卡通按元直储(普通接口)", "", "", ""), new Array(
				"1131", "W-网易-按元充值(官方接口)", "", "", ""), new Array("1129",
				"W-网易-战网一卡通按元直储(官方接口)", "", "", ""), new Array("1302",
				"S-盛大-全游戏按元充值", "", "", ""), new Array("1274",
				"S-盛大-盛大点券按元充值通用模板", "", "", ""), new Array("1275",
				"S-盛大-盛大热血传奇元宝按元充值", "", "", ""), new Array("1201",
				"S-盛大-热血传奇按元充值", "", "", ""), new Array("1202",
				"S-盛大-英雄年代按元充值", "", "", ""), new Array("1203", "S-盛大-神迹按元充值",
				"", "", ""), new Array("1204", "S-盛大-传奇世界按元充值", "", "", ""),
		new Array("1205", "S-盛大-梦幻国度按元充值", "", "", ""), new Array("1206",
				"S-盛大-泡泡堂按元充值", "", "", ""), new Array("1207", "S-盛大-热血英豪按元充值",
				"", "", ""), new Array("1208", "S-盛大-冒险岛按元充值", "", "", ""),
		new Array("1209", "S-盛大-仙境传说按元充值", "", "", ""), new Array("1210",
				"S-盛大-传奇世界专区卡按元充值", "", "", ""), new Array("1287",
				"S-盛大-传奇归来按元充值", "", "", ""), new Array("1211",
				"S-盛大-神迹专区卡按元充值", "", "", ""), new Array("1212",
				"S-盛大-英雄年代区域化按元充值", "", "", ""), new Array("1213",
				"S-盛大-神迹区域化按元充值", "", "", ""), new Array("1214",
				"S-盛大-S-盛大富翁按元充值", "", "", ""), new Array("1215",
				"S-盛大-边锋按元充值", "", "", ""), new Array("1217", "S-盛大-游戏茶苑按元充值",
				"", "", ""), new Array("1218", "S-盛大-S-盛大点券按元充值", "", "", ""),
		new Array("1219", "S-盛大-疯狂赛车按元充值", "", "", ""), new Array("1220",
				"S-盛大-霸王II按元充值", "", "", ""), new Array("1221",
				"S-盛大-浩方对战平台按元充值", "", "", ""), new Array("1222",
				"S-盛大-起点中文网按元充值", "", "", ""), new Array("1224",
				"S-盛大-彩虹岛按元充值", "", "", ""), new Array("1225", "S-盛大-功夫小子按元充值",
				"", "", ""), new Array("1226", "S-盛大-超级跑跑按元充值", "", "", ""),
		new Array("1227", "S-盛大-推推侠按元充值", "", "", ""), new Array("1228",
				"S-盛大-纵横天下按元充值", "", "", ""), new Array("1229", "S-盛大-风云按元充值",
				"", "", ""), new Array("1231", "S-盛大-泡泡岛按元充值", "", "", ""),
		new Array("1232", "S-盛大-碰碰乐按元充值", "", "", ""), new Array("1233",
				"S-盛大-苍天按元充值", "", "", ""), new Array("1234",
				"S-盛大-彩虹岛重庆专区按元充值", "", "", ""), new Array("1235",
				"S-盛大-新英雄年代按元充值", "", "", ""), new Array("1236",
				"S-盛大-新英雄年代区域化按元充值", "", "", ""), new Array("1237",
				"S-盛大-X-乒乓按元充值", "", "", ""), new Array("1238",
				"S-盛大-晋江文学网按元充值", "", "", ""), new Array("1239",
				"S-盛大-龙神传说按元充值", "", "", ""), new Array("1240",
				"S-盛大-英雄之门按元充值", "", "", ""), new Array("1241",
				"S-盛大-天地纵横按元充值", "", "", ""), new Array("1242",
				"S-盛大-千年3按元充值模板", "", "", ""), new Array("1243",
				"S-盛大-生死格斗online按元充值", "", "", ""), new Array("1244",
				"S-盛大-传奇外传按元充值", "", "", ""), new Array("1245",
				"S-盛大-鬼吹灯外传按元在线充值", "", "", ""), new Array("1247",
				"S-盛大-新龙骑士按元在线充值", "", "", ""), new Array("1248",
				"S-盛大-战神世界II按元在线充值", "", "", ""), new Array("1249",
				"S-盛大-帝国崛起按元在线充值", "", "", ""), new Array("1250",
				"S-盛大-英雄连Online按元在线充值", "", "", ""), new Array("1252",
				"S-盛大-八门按元在线充值", "", "", ""), new Array("1253",
				"S-盛大-巨星按元在线充值", "", "", ""), new Array("1254",
				"S-盛大-穿越Online按元在线充值", "", "", ""), new Array("1286",
				"S-盛大-大战舰按元在线充值", "", "", ""), new Array("1255",
				"S-盛大绿卡-英雄年代按元充值", "", "", ""), new Array("1256",
				"S-盛大绿卡-梦幻国度按元充值", "", "", ""), new Array("1257",
				"S-盛大绿卡-神迹按元充值", "", "", ""), new Array("1258",
				"S-盛大绿卡-热血英豪按元充值", "", "", ""), new Array("1259",
				"S-盛大绿卡-疯狂赛车按元充值", "", "", ""), new Array("1260",
				"S-盛大绿卡-功夫小子按元充值", "", "", ""), new Array("1261",
				"S-盛大绿卡-起点中文网按元充值", "", "", ""), new Array("1262",
				"S-盛大绿卡鬼吹灯外传按元在线充值", "", "", ""), new Array("1263",
				"S-盛大绿卡-生死格斗online按元充值", "", "", ""), new Array("1264",
				"S-盛大绿卡-穿越Online按元在线充值", "", "", ""), new Array("1284",
				"S-盛大绿卡-诸候按元在线充值", "", "", ""), new Array("1265",
				"S-盛大-万象网管2004,2008标准版按月充值", "", "", ""), new Array("1266",
				"S-盛大-万象网管2006,2008增强版按月充值", "", "", ""), new Array("1271",
				"S-盛大-华山论剑按元在线充值", "", "", ""), new Array("1276",
				"S-盛大-永恒之塔按元在线充值", "", "", ""), new Array("1277",
				"S-盛大-剑侠世界按元在线充值", "", "", ""), new Array("1279",
				"S-盛大-蜀山online按元在线充值", "", "", ""), new Array("1280",
				"S-盛大-欧洲足球按元在线充值", "", "", ""), new Array("1281",
				"S-盛大-(只充盛大通行证)永恒之塔按元在线充值", "", "", ""), new Array("1282",
				"S-盛大-新魔界按元在线充值", "", "", ""), new Array("1283",
				"S-盛大-诸候按元在线充值", "", "", ""), new Array("1285",
				"S-盛大-功夫世界按元在线充值", "", "", ""), new Array("1289",
				"S-盛大-圈圈大冒险按元充值", "", "", ""), new Array("1290",
				"S-盛大-红袖添香网按元充值", "", "", ""), new Array("1291",
				"S-盛大-动趣网按元充值", "", "", ""), new Array("1292", "S-盛大-热血三国按元充值",
				"", "", ""), new Array("1293", "S-盛大-问鼎封神按元充值", "", "", ""),
		new Array("1294", "S-盛大-商业大亨按元充值", "", "", ""), new Array("1295",
				"S-盛大-吞食天地2Online按元充值", "", "", ""), new Array("1296",
				"S-盛大-剑侠贰外传按元充值", "", "", ""), new Array("1297",
				"S-盛大-激斗按元在线充值", "", "", ""), new Array("1298",
				"S-盛大-预言Online(盛大版)按元充值", "", "", ""), new Array("1299",
				"S-盛大-武林英雄按元充值", "", "", ""), new Array("1300",
				"S-盛大-成吉思汗按元充值", "", "", ""), new Array("1301",
				"S-盛大-空战世纪按元充值", "", "", ""), new Array("1303", "S-盛大-弹弹堂按元充值",
				"", "", ""), new Array("1304", "S-盛大-新倚天剑与屠龙刀按元在线充值", "", "",
				""), new Array("1305", "S-盛大-剑侠情缘网络版叁按元在线充值", "", "", ""),
		new Array("1306", "S-盛大-龙之谷按元在线充值", "", "", ""), new Array("1307",
				"S-盛大-诸侯-后宫计按元在线充值", "", "", ""), new Array("1308",
				"S-盛大-自在飞车按元在线充值", "", "", ""), new Array("1309",
				"S-盛大-大富豪按元在线充值", "", "", ""), new Array("1310",
				"S-盛大-倾城按元在线充值", "", "", ""), new Array("1311",
				"S-盛大-魔塔世界按元在线充值", "", "", ""), new Array("1312",
				"S-盛大-星尘-星空战记按元充值", "", "", ""), new Array("1313",
				"S-盛大-传世群英传按元充值", "", "", ""), new Array("1701",
				"S-搜狐天龙八部自动充值", "", "", ""), new Array("1702",
				"S-搜狐天龙八部自动充值(需用户填写登录密码)", "", "", ""), new Array("1703",
				"S-搜狐Eslaes按元自动充值", "", "", ""), new Array("1704",
				"S-搜狐Eslaes按元自动充值(5元倍数)", "", "", ""), new Array("11001",
				"S-绿岸网络蜀门在线充值", "", "", ""), new Array("1801",
				"S-世纪天成-跑跑卡丁车/洛奇充值", "", "", ""), new Array("10201",
				"S-顺网蝌蚪通行证蝌蚪币按元充值", "", "", ""), new Array("1802",
				"T-天游-街头篮球按元充值", "", "", ""), new Array("1805",
				"T-天游-拍拍部落按元充值", "", "", ""), new Array("1811",
				"T-天游直通车街头篮球充值", "", "", ""), new Array("1814",
				"T-天游直通车拍拍部落充值", "", "", ""), new Array("1815", "T-天游所有游戏单张充值",
				"", "", ""),
		new Array("1816", "T-天游Eslaes所有游戏按元充值", "", "", ""), new Array("10001",
				"T-天游-露娜按元充值", "", "", ""), new Array("10401",
				"W-武神一卡通在线充值(单张)", "", "", ""), new Array("1501",
				"Y-一起玩-中华网所有游戏按元充值", "", "", ""), new Array("10301",
				"Z-中青宝网一卡通在线充值", "", "", ""), new Array("10701",
				"Z-臻游（全球使命）按元充值", "", "", ""), new Array("1601",
				"B-暴雨预言卡密转在线自动充值模板", "", "", ""), new Array("151",
				"G-光宇一卡通卡密转在线自动充值模板", "", "", ""), new Array("651",
				"J-金山一卡通卡密转在线自动充值模板", "", "", ""), new Array("751",
				"J-久游卡密转在线自动充值模板(需密码)", "", "", ""), new Array("9001",
				"M-摩力游卡密转在线自动充值模板", "", "", ""), new Array("1051",
				"W-完美一卡通卡密转在线自动充值模板", "", "", ""), new Array("1151",
				"W-网易卡密转在线自动充值模板", "", "", ""), new Array("1152",
				"W-网易-战网一卡通卡密转在线自动充值模板", "", "", ""), new Array("1499",
				"S-盛大一卡通卡密转在线自动充值模板", "", "", ""), new Array("1751",
				"S-搜狐畅游一卡通卡密转在线自动充值模板(虚拟卡)(单张)", "", "", ""), new Array("1752",
				"S-搜狐畅游一卡通卡密转在线自动充值模板(虚拟卡)(可充多张)", "", "", ""), new Array(
				"1753", "S-搜狐畅游一卡通卡密转在线自动充值模板(实物卡)(单张)", "", "", ""),
		new Array("1754", "S-搜狐畅游一卡通卡密转在线自动充值模板(实物卡)(可充多张)", "", "", ""),
		new Array("10501", "T-淘米摩尔庄园卡密转在线自动充值模板", "", "", ""), new Array(
				"1852", "T-天游一卡通卡密转在线自动充值模板", "", "", ""), new Array("1551",
				"Z-中华网一卡通卡密转在线自动充值模板", "", "", ""), new Array("1951",
				"Z-征途卡密转在线自动充值模板", "", "", ""), new Array("1952",
				"Z-征途卡密转在线自动充值模板(可充多张)", "", "", ""), new Array("10102",
				"Q-麒麟一卡通卡密转在线自动充值模板(单张)", "", "", ""), new Array("10601",
				"Q-千橡游戏人人一卡通卡密转在线自动充值", "", "", ""), new Array("10302",
				"A-奥比岛卡密转自动(单张)", "", "", ""), new Array("10303",
				"A-奥比岛卡密转自动(充值红宝石岛民1个月)", "", "", ""), new Array("10304",
				"A-奥比岛卡密转自动(充值红宝石岛民3个月)", "", "", ""), new Array("451",
				"L-蓝港卡密转在线自动充值模板(单张)", "", "", ""), new Array("3001",
				"5173在线充值", "", "", ""), new Array("4001", "51交友51币充值专用模板", "",
				"", ""), new Array("4002", "51交友VIP充值专用模板", "", "", ""));
var $d = new Array("tpl", "czidname", "areaserv");
showtpl($("ubzptype"));
function ShowAllCzTpl(id) {
	var $e = $("ubzocztpl").value;
	var $f = 0;
	var s = document.createElement("select");
	s.onchange = function() {
		SetTplItems(this);
	};
	s.style.marginRight = "6px";
	s.size = 1;
	s.name = "ubzcztpl";
	s.setAttribute("id", "cat");
	s.options[0] = new Option("选择模板", 0);
	for (i = 0; i < $c.length; i++) {
		s.options[s.length] = new Option($c[i][1], $c[i][0]);
		if ($e == $c[i][0]) {
			s.options[i + 1].selected = true;
		}
	}
	;
	$(id).appendChild(s);
};
function showtpl($a) {
	var $b = $a.options[$a.selectedIndex].value;
	if ($b > 3 && $b < 7) {
	}
	;
	for (i = 0; i < $d.length; i++) {
		$($d[i]).style.display = "none";
		$("quickusetr").style.display = "";
		$("quickusetimetr").style.display = "";
	}
	;
	if ($("ubzmycztpl"))
		$("ubzmycztpl").style.display = "none";
	if ($b == 1 || $b == 2) {
		$("tpl").style.display = "";
		$("czidname").style.display = "";
		$("spanidlable").innerHTML = "充值ID名称：";
		$("tipidlable").innerHTML = "(玩家用户名的叫法,比如充Q币时叫QQ号,充游戏时叫帐号)";
		$("spanareaserv").innerHTML = "区服显示：";
		$("spanareaserv1").style.display = "none";
		$("spanareaserv2").style.display = "none";
		$("tradeterm").style.display = "none";
		$("disponshow").style.display = "none";
		$("stocks").style.display = "none";
		$("unit").style.display = "none";
		$("unit").style.display = "none";
		$("quickusetr").style.display = "none";
		$("quickusetimetr").style.display = "none";
		if ($b == 2) {
			if ($("ubzmycztpl"))
				$("ubzmycztpl").style.display = "";
		}
	}
	;
	if ($b == 4 || $b == 5) {
		$("tpl").style.display = "";
		$("czidname").style.display = "";
		$("spanidlable").innerHTML = "充值ID名称：";
		$("tipidlable").innerHTML = "(玩家用户名的叫法,比如充Q币时叫QQ号,充游戏时叫帐号)";
		$("spanareaserv").innerHTML = "区服显示：";
		$("spanareaserv1").style.display = "";
		$("spanareaserv2").style.display = "none";
		$("areaserv").style.display = "";
		$("tradeterm").style.display = "none";
		$("disponshow").style.display = "none";
		$("stocks").style.display = "";
		$("unit").style.display = "";
	}
	;
	if ($b == 3) {
		$("czidname").style.display = "";
		$("spanidlable").innerHTML = "号码名称：";
		$("tipidlable").innerHTML = "(号码的叫法,比如QQ号,手机号)";
		$("spanareaserv").innerHTML = "购买属性：";
		$("spanareaserv1").style.display = "none";
		$("spanareaserv2").style.display = "";
		$("areaserv").style.display = "";
		$("tradeterm").style.display = "none";
		$("disponshow").style.display = "none";
		$("stocks").style.display = "none";
		$("unit").style.display = "none";
		$("quickusetr").style.display = "";
		$("quickusetimetr").style.display = "";
	}
	;
	if ($b == 4 || $b == 5) {
		$("tradeterm").style.display = "";
		$("disponshow").style.display = "";
		$("stocks").style.display = "";
		$("unit").style.display = "";
	}
};
function SetTplItems($a) {
	var $g = $a.options[$a.selectedIndex].value;
	if ($g > 800 && $g < 901) {
		$("ubzidlable").value = "QQ";
	} else if ($g == 2001) {
		$("ubzidlable").value = "手机号";
	} else if ($g == 1109 || $g == 1129) {
		$("ubzidlable").value = "战网通行证";
	} else {
		$("ubzidlable").value = "帐号";
	}
};
ShowAllCzTpl("tpllist");
